# -8- coding: utf=8 -*-                         # 컴파일러가 읽는 문자종류 지정

print("마리에겐 꼬마 양이 있지.")                  #  문자열 출력
print("양털은 %s처럼 새하얗네." % '눈')            #  스트링 포맷을 이용해 문자열에 문자
print("그리고 마리가 가는 곳마다.")
print("." * 10)  # 어떻게 될까요?                 #  해당 문자열 10번 반복

end1 = "맛"                                     #  변수 지정
end2 = "있"
end3 = "는"
end4 = "치"
end5 = "즈"
end6 = "버"
end7 = "거"

# 마지막에 쉼표가 보이죠? 지워보고 무슨 일이 일어나나 보세요  # 출력 후 다음줄로 넘어가지 않고 같은 줄에서 다음 실행명령 결과 출력
print(end1 + end2 + end3)                      #  문자열들 이어서 출력
print(end4 + end5 + end6 + end7)
