# -*- coding: utf-8 -*-

print "닭을 세어 봅시다."
# 닭을 세어 보자는 말을 출력

print "암탉", 25 + 30 /6
# 암탉이라는 글자 출력 후에 계산수식을 입력하여 계산결과값 출력
print "수탉", 100 - 25 * 3 % 4
# 수탉이라는 글자를 출력하고 연산, 연산 수식의 우선순위는 우리가 일반적으로 계산하는 방식과 유사

print "이제 달걀도 세어 봅시다"
# 그래

print 3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6
# 계산식이지
# 

print "3 + 2 < 5 - 7 는 참인가요?"

print 3 + 2 < 5 - 7

print "3 + 2 는 얼마죠?", 3 + 2
print "5 - 7 는 얼마죠?", 5 - 7

print "아하 이게 False인 이유네요"

print "더 해볼까요."

print "더 큰가요?", 5 > -2
print "더 크거나 같나요?", 5 >= -2
print "더 작거나 같나요?", 5 <= -2